productblog/app/views/users/show.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 4]]
---
  <h4>Adress Details</h4>
  <% @user.addresses.each do |address| %>