productblog/app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

    def set_lineitem
      @lineitem = Lineitem.find(params[:id])
---
SELECT  "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]