productblog/app/controllers/orders_controller.rb

  def new
          @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC