productblog/app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name LIKE '%t-shirt%' OR sku LIKE '%t-shirt%') ORDER BY created_at DESC

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("sku", "name", "category_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)  [["sku", ""], ["name", "Neha"], ["category_id", 1], ["created_at", "2018-03-08 11:06:38.758368"], ["updated_at", "2018-03-08 11:06:38.758368"], ["image", "tshirt.jpeg"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "sku" = ?, "name" = ?, "quantity" = ?, "length" = ?, "width" = ?, "height" = ?, "weight" = ?, "price" = ?, "category_id" = ?, "image" = ?, "updated_at" = ? WHERE "products"."id" = ?