productblog/app/controllers/users_controller.rb

def get_addresses
   @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if User.where(email: @user.email).empty?


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email", ""], ["dob", "2018-03-08"], ["created_at", "2018-03-08 13:45:09.142276"], ["updated_at", "2018-03-08 13:45:09.142276"]]