productblog/app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :product_category_id %><br />
    <%= form.collection_select :category_id, Category.all, :id, :name, :prompt => "Select a Category" %>