productblog/app/views/orders/_form.html.erb

   <%= f.label :user_id %>
   <%= f.select :user_id, User.all.collect{|user| [user.first_name+" "+user.last_name, user.id]}, {:prompt => true}, {id: 'customer_id'} %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

              <%= f.label :address_id %>
              <%= f.grouped_collection_select :address_id, User.order(:id), :addresses, :id, :id, :line_1, {:prompt => true}, { id: 'order_address_id'} %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 43]]