productblog/app/views/orders/index.html.erb

      <%= content_tag_for(:tr, @orders) do |order| %>
            <td><%= order.order_no %></td>
---
SELECT "orders".* FROM "orders"